app/views/okrs/index.html.erb

SELECT "okrs".* FROM "okrs" WHERE "okrs"."team_id" = ?  [["team_id", 1]]
---
        <tbody>
          <% @team.okrs.each do |okr| %>