app/controllers/krs_controller.rb

  def new
    @team = Team.find(params[:team_id])
    @okr = Okr.find(params[:okr_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "okrs".* FROM "okrs" WHERE "okrs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @okr = Okr.find(params[:okr_id])
---
SELECT  "okrs".* FROM "okrs" WHERE "okrs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @team = Team.find(params[:team_id])
    @okr = Okr.find(params[:okr_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "okrs".* FROM "okrs" WHERE "okrs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def set_team
      @team = Team.find(params[:team_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_okr
      @okr = Okr.find(params[:okr_id])
---
SELECT  "okrs".* FROM "okrs" WHERE "okrs"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]