app/controllers/okrs_controller.rb

SELECT "okrs".* FROM "okrs"
---
  def index
    @okrs = Okr.all

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @team = Team.find(params[:team_id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @team = Team.find(params[:team_id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "okrs" ("title", "description", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "OKR1"], ["description", "testeOKR1"], ["team_id", 1], ["created_at", 2016-11-08 17:09:05 UTC], ["updated_at", 2016-11-08 17:09:05 UTC]]
---
  def create
    @team = Team.find(params[:team_id])
    @okr = Okr.new(okr_params)

      if @okr.save

UPDATE "okrs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "okrs"."id" = ?  [["title", "Todalooo"], ["description", "MOtherfucker"], ["updated_at", 2016-10-20 23:10:02 UTC], ["id", 2]]
---
  def update

      if @okr.update(okr_params)

DELETE FROM "okrs" WHERE "okrs"."id" = ?  [["id", 1]]
---
  def destroy

    @okr.destroy

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:team_id])

SELECT  "okrs".* FROM "okrs" WHERE "okrs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_okr
      @okr = Okr.find(params[:id])