app/controllers/teams_controller.rb

INSERT INTO "teams" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

UPDATE "teams" SET "description" = ?, "updated_at" = ? WHERE "teams"."id" = ?
---
  def update
    respond_to do |format|
      if @team.update(team_params)

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
---
  def destroy
    @team.destroy

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:id])